In [1]:
import numpy as np

In [2]:
import pandas as pd

In [3]:
A = [1,2,3,4]
B = [5,6,7,8]
C = [9,0,1,2]
D = [3,4,5,6]
E = [7,8,9,0]

In [8]:
df = pd.DataFrame([A,B,C,D,E],['a','b','c','d','e'],['W','X','Y','Z'])

In [9]:
df

   W  X  Y  Z
a  1  2  3  4
b  5  6  7  8
c  9  0  1  2
d  3  4  5  6
e  7  8  9  0

In [10]:
df['P'] = df['X'] +df['Y']  # add new column

In [11]:
df

   W  X  Y  Z   P
a  1  2  3  4   5
b  5  6  7  8  13
c  9  0  1  2   1
d  3  4  5  6   9
e  7  8  9  0  17

In [13]:
df.drop('e')  # delete rowos not permanently

   W  X  Y  Z   P
a  1  2  3  4   5
b  5  6  7  8  13
c  9  0  1  2   1
d  3  4  5  6   9

In [14]:
df

   W  X  Y  Z   P
a  1  2  3  4   5
b  5  6  7  8  13
c  9  0  1  2   1
d  3  4  5  6   9
e  7  8  9  0  17

In [20]:
df.drop('P', axis=1, inplace = True)

In [21]:
df

   W  X  Y  Z
a  1  2  3  4
b  5  6  7  8
c  9  0  1  2
d  3  4  5  6
e  7  8  9  0

In [22]:
df.drop('e', inplace=True)

In [23]:
df

   W  X  Y  Z
a  1  2  3  4
b  5  6  7  8
c  9  0  1  2
d  3  4  5  6

In [24]:
df

   W  X  Y  Z
a  1  2  3  4
b  5  6  7  8
c  9  0  1  2
d  3  4  5  6

In [29]:
df.loc['a']       #Access any column

W    1
X    2
Y    3
Z    4
Name: a, dtype: int64

In [32]:
df.iloc[1]   #Access rowos

W    5
X    6
Y    7
Z    8
Name: b, dtype: int64

In [34]:
df.loc['c','Z']  #Access any element

2

In [35]:
df>3  #All the values geter than 3

       W      X      Y      Z
a  False  False  False   True
b   True   True   True   True
c   True  False  False  False
d  False   True   True   True

In [36]:
df[df>3]

     W    X    Y    Z
a  NaN  NaN  NaN  4.0
b  5.0  6.0  7.0  8.0
c  9.0  NaN  NaN  NaN
d  NaN  4.0  5.0  6.0

In [38]:
df[df['W']>3]

   W  X  Y  Z
b  5  6  7  8
c  9  0  1  2

In [39]:
df[df['W']>3][['W','X']]  #W and X column value

   W  X
b  5  6
c  9  0

In [43]:
df[df['W']>=9]['W']    #particular column value

c    9
Name: W, dtype: int64

In [46]:
df[(df['W']>3) & (df['Z']>2)]

   W  X  Y  Z
b  5  6  7  8